GopalSaraf/Practicals/PSDL/include/proc/pic18lf8680.inc
// Register: RXFCON1
#define RXFCON1 RXFCON1
RXFCON1                                  equ 0DD5h
// bitfield definitions
RXFCON1_RXF8EN_POSN                      equ 0000h
RXFCON1_RXF8EN_POSITION                  equ 0000h
RXFCON1_RXF8EN_SIZE                      equ 0001h
RXFCON1_RXF8EN_LENGTH                    equ 0001h
RXFCON1_RXF8EN_MASK                      equ 0001h
RXFCON1_RXF9EN_POSN                      equ 0001h
RXFCON1_RXF9EN_POSITION                  equ 0001h
RXFCON1_RXF9EN_SIZE                      equ 0001h
RXFCON1_RXF9EN_LENGTH                    equ 0001h
RXFCON1_RXF9EN_MASK                      equ 0002h
RXFCON1_RXF10EN_POSN                     equ 0002h
RXFCON1_RXF10EN_POSITION                 equ 0002h
RXFCON1_RXF10EN_SIZE                     equ 0001h
RXFCON1_RXF10EN_LENGTH                   equ 0001h
RXFCON1_RXF10EN_MASK                     equ 0004h
RXFCON1_RXF11EN_POSN                     equ 0003h
RXFCON1_RXF11EN_POSITION                 equ 0003h
RXFCON1_RXF11EN_SIZE                     equ 0001h
RXFCON1_RXF11EN_LENGTH                   equ 0001h
RXFCON1_RXF11EN_MASK                     equ 0008h
RXFCON1_RXF12EN_POSN                     equ 0004h
RXFCON1_RXF12EN_POSITION                 equ 0004h
RXFCON1_RXF12EN_SIZE                     equ 0001h
RXFCON1_RXF12EN_LENGTH                   equ 0001h
RXFCON1_RXF12EN_MASK                     equ 0010h
RXFCON1_RXF13EN_POSN                     equ 0005h
RXFCON1_RXF13EN_POSITION                 equ 0005h
RXFCON1_RXF13EN_SIZE                     equ 0001h
RXFCON1_RXF13EN_LENGTH                   equ 0001h
RXFCON1_RXF13EN_MASK                     equ 0020h
RXFCON1_RXF14EN_POSN                     equ 0006h
RXFCON1_RXF14EN_POSITION                 equ 0006h
RXFCON1_RXF14EN_SIZE                     equ 0001h
RXFCON1_RXF14EN_LENGTH                   equ 0001h
RXFCON1_RXF14EN_MASK                     equ 0040h
RXFCON1_RXF15EN_POSN                     equ 0007h
RXFCON1_RXF15EN_POSITION                 equ 0007h
RXFCON1_RXF15EN_SIZE                     equ 0001h
RXFCON1_RXF15EN_LENGTH                   equ 0001h
RXFCON1_RXF15EN_MASK                     equ 0080h

// Register: SDFLC
#define SDFLC SDFLC
SDFLC                                    equ 0DD8h
// bitfield definitions
SDFLC_DFLC0_POSN                         equ 0000h
SDFLC_DFLC0_POSITION                     equ 0000h
SDFLC_DFLC0_SIZE                         equ 0001h
SDFLC_DFLC0_LENGTH                       equ 0001h
SDFLC_DFLC0_MASK                         equ 0001h
SDFLC_DFLC1_POSN                         equ 0001h
SDFLC_DFLC1_POSITION                     equ 0001h
SDFLC_DFLC1_SIZE                         equ 0001h
SDFLC_DFLC1_LENGTH                       equ 0001h
SDFLC_DFLC1_MASK                         equ 0002h
SDFLC_DFLC2_POSN                         equ 0002h
SDFLC_DFLC2_POSITION                     equ 0002h
SDFLC_DFLC2_SIZE                         equ 0001h
SDFLC_DFLC2_LENGTH                       equ 0001h
SDFLC_DFLC2_MASK                         equ 0004h
SDFLC_DFLC3_POSN                         equ 0003h
SDFLC_DFLC3_POSITION                     equ 0003h
SDFLC_DFLC3_SIZE                         equ 0001h
SDFLC_DFLC3_LENGTH                       equ 0001h
SDFLC_DFLC3_MASK                         equ 0008h
SDFLC_DFLC4_POSN                         equ 0004h
SDFLC_DFLC4_POSITION                     equ 0004h
SDFLC_DFLC4_SIZE                         equ 0001h
SDFLC_DFLC4_LENGTH                       equ 0001h
SDFLC_DFLC4_MASK                         equ 0010h

// Register: RXFBCON0
#define RXFBCON0 RXFBCON0
RXFBCON0                                 equ 0DE0h
// bitfield definitions
RXFBCON0_F0BP_0_POSN                     equ 0000h
RXFBCON0_F0BP_0_POSITION                 equ 0000h
RXFBCON0_F0BP_0_SIZE                     equ 0001h
RXFBCON0_F0BP_0_LENGTH                   equ 0001h
RXFBCON0_F0BP_0_MASK                     equ 0001h
RXFBCON0_F0BP_1_POSN                     equ 0001h
RXFBCON0_F0BP_1_POSITION                 equ 0001h
RXFBCON0_F0BP_1_SIZE                     equ 0001h
RXFBCON0_F0BP_1_LENGTH                   equ 0001h
RXFBCON0_F0BP_1_MASK                     equ 0002h
RXFBCON0_F0BP_2_POSN                     equ 0002h
RXFBCON0_F0BP_2_POSITION                 equ 0002h
RXFBCON0_F0BP_2_SIZE                     equ 0001h
RXFBCON0_F0BP_2_LENGTH                   equ 0001h
RXFBCON0_F0BP_2_MASK                     equ 0004h
RXFBCON0_F0BP_3_POSN                     equ 0003h
RXFBCON0_F0BP_3_POSITION                 equ 0003h
RXFBCON0_F0BP_3_SIZE                     equ 0001h
RXFBCON0_F0BP_3_LENGTH                   equ 0001h
RXFBCON0_F0BP_3_MASK                     equ 0008h
RXFBCON0_F1BP_0_POSN                     equ 0004h
RXFBCON0_F1BP_0_POSITION                 equ 0004h
RXFBCON0_F1BP_0_SIZE                     equ 0001h
RXFBCON0_F1BP_0_LENGTH                   equ 0001h
RXFBCON0_F1BP_0_MASK                     equ 0010h
RXFBCON0_F1BP_1_POSN                     equ 0005h
RXFBCON0_F1BP_1_POSITION                 equ 0005h
RXFBCON0_F1BP_1_SIZE                     equ 0001h
RXFBCON0_F1BP_1_LENGTH                   equ 0001h
RXFBCON0_F1BP_1_MASK                     equ 0020h
RXFBCON0_F1BP_2_POSN                     equ 0006h
RXFBCON0_F1BP_2_POSITION                 equ 0006h
RXFBCON0_F1BP_2_SIZE                     equ 0001h
RXFBCON0_F1BP_2_LENGTH                   equ 0001h
RXFBCON0_F1BP_2_MASK                     equ 0040h
RXFBCON0_F1BP_3_POSN                     equ 0007h
RXFBCON0_F1BP_3_POSITION                 equ 0007h
RXFBCON0_F1BP_3_SIZE                     equ 0001h
RXFBCON0_F1BP_3_LENGTH                   equ 0001h
RXFBCON0_F1BP_3_MASK                     equ 0080h
RXFBCON0_F0BP_01_POSN                    equ 0000h
RXFBCON0_F0BP_01_POSITION                equ 0000h
RXFBCON0_F0BP_01_SIZE                    equ 0001h
RXFBCON0_F0BP_01_LENGTH                  equ 0001h
RXFBCON0_F0BP_01_MASK                    equ 0001h

// Register: RXFBCON1
#define RXFBCON1 RXFBCON1
RXFBCON1                                 equ 0DE1h
// bitfield definitions
RXFBCON1_F2BP_0_POSN                     equ 0000h
RXFBCON1_F2BP_0_POSITION                 equ 0000h
RXFBCON1_F2BP_0_SIZE                     equ 0001h
RXFBCON1_F2BP_0_LENGTH                   equ 0001h
RXFBCON1_F2BP_0_MASK                     equ 0001h
RXFBCON1_F2BP_1_POSN                     equ 0001h
RXFBCON1_F2BP_1_POSITION                 equ 0001h
RXFBCON1_F2BP_1_SIZE                     equ 0001h
RXFBCON1_F2BP_1_LENGTH                   equ 0001h
RXFBCON1_F2BP_1_MASK                     equ 0002h
RXFBCON1_F2BP_2_POSN                     equ 0002h
RXFBCON1_F2BP_2_POSITION                 equ 0002h
RXFBCON1_F2BP_2_SIZE                     equ 0001h
RXFBCON1_F2BP_2_LENGTH                   equ 0001h
RXFBCON1_F2BP_2_MASK                     equ 0004h
RXFBCON1_F2BP_3_POSN                     equ 0003h
RXFBCON1_F2BP_3_POSITION                 equ 0003h
RXFBCON1_F2BP_3_SIZE                     equ 0001h
RXFBCON1_F2BP_3_LENGTH                   equ 0001h
RXFBCON1_F2BP_3_MASK                     equ 0008h
RXFBCON1_F3BP_0_POSN                     equ 0004h
RXFBCON1_F3BP_0_POSITION                 equ 0004h
RXFBCON1_F3BP_0_SIZE                     equ 0001h
RXFBCON1_F3BP_0_LENGTH                   equ 0001h
RXFBCON1_F3BP_0_MASK                     equ 0010h
RXFBCON1_F3BP_1_POSN                     equ 0005h
RXFBCON1_F3BP_1_POSITION                 equ 0005h
RXFBCON1_F3BP_1_SIZE                     equ 0001h
RXFBCON1_F3BP_1_LENGTH                   equ 0001h
RXFBCON1_F3BP_1_MASK                     equ 0020h
RXFBCON1_F3BP_2_POSN                     equ 0006h
RXFBCON1_F3BP_2_POSITION                 equ 0006h
RXFBCON1_F3BP_2_SIZE                     equ 0001h
RXFBCON1_F3BP_2_LENGTH                   equ 0001h
RXFBCON1_F3BP_2_MASK                     equ 0040h
RXFBCON1_F3BP_3_POSN                     equ 0007h
RXFBCON1_F3BP_3_POSITION                 equ 0007h
RXFBCON1_F3BP_3_SIZE                     equ 0001h
RXFBCON1_F3BP_3_LENGTH                   equ 0001h
RXFBCON1_F3BP_3_MASK                     equ 0080h
RXFBCON1_F2BP_01_POSN                    equ 0000h
RXFBCON1_F2BP_01_POSITION                equ 0000h
RXFBCON1_F2BP_01_SIZE                    equ 0001h
RXFBCON1_F2BP_01_LENGTH                  equ 0001h
RXFBCON1_F2BP_01_MASK                    equ 0001h

// Register: RXFBCON2
#define RXFBCON2 RXFBCON2
RXFBCON2                                 equ 0DE2h
// bitfield definitions
RXFBCON2_F4BP_0_POSN                     equ 0000h
RXFBCON2_F4BP_0_POSITION                 equ 0000h
RXFBCON2_F4BP_0_SIZE                     equ 0001h
RXFBCON2_F4BP_0_LENGTH                   equ 0001h
RXFBCON2_F4BP_0_MASK                     equ 0001h
RXFBCON2_F4BP_1_POSN                     equ 0001h
RXFBCON2_F4BP_1_POSITION                 equ 0001h
RXFBCON2_F4BP_1_SIZE                     equ 0001h
RXFBCON2_F4BP_1_LENGTH                   equ 0001h
RXFBCON2_F4BP_1_MASK                     equ 0002h
RXFBCON2_F4BP_2_POSN                     equ 0002h
RXFBCON2_F4BP_2_POSITION                 equ 0002h
RXFBCON2_F4BP_2_SIZE                     equ 0001h
RXFBCON2_F4BP_2_LENGTH                   equ 0001h
RXFBCON2_F4BP_2_MASK                     equ 0004h
RXFBCON2_F4BP_3_POSN                     equ 0003h
RXFBCON2_F4BP_3_POSITION                 equ 0003h
RXFBCON2_F4BP_3_SIZE                     equ 0001h
RXFBCON2_F4BP_3_LENGTH                   equ 0001h
RXFBCON2_F4BP_3_MASK                     equ 0008h
RXFBCON2_F5BP_0_POSN                     equ 0004h
RXFBCON2_F5BP_0_POSITION                 equ 0004h
RXFBCON2_F5BP_0_SIZE                     equ 0001h
RXFBCON2_F5BP_0_LENGTH                   equ 0001h
RXFBCON2_F5BP_0_MASK                     equ 0010h
RXFBCON2_F5BP_1_POSN                     equ 0005h
RXFBCON2_F5BP_1_POSITION                 equ 0005h
RXFBCON2_F5BP_1_SIZE                     equ 0001h
RXFBCON2_F5BP_1_LENGTH                   equ 0001h
RXFBCON2_F5BP_1_MASK                     equ 0020h
RXFBCON2_F5BP_2_POSN                     equ 0006h
RXFBCON2_F5BP_2_POSITION                 equ 0006h
RXFBCON2_F5BP_2_SIZE                     equ 0001h
RXFBCON2_F5BP_2_LENGTH                   equ 0001h
RXFBCON2_F5BP_2_MASK                     equ 0040h
RXFBCON2_F5BP_3_POSN                     equ 0007h
RXFBCON2_F5BP_3_POSITION                 equ 0007h
RXFBCON2_F5BP_3_SIZE                     equ 0001h
RXFBCON2_F5BP_3_LENGTH                   equ 0001h
RXFBCON2_F5BP_3_MASK                     equ 0080h
RXFBCON2_F4BP_01_POSN                    equ 0000h
RXFBCON2_F4BP_01_POSITION                equ 0000h
RXFBCON2_F4BP_01_SIZE                    equ 0001h
RXFBCON2_F4BP_01_LENGTH                  equ 0001h
RXFBCON2_F4BP_01_MASK                    equ 0001h

