GopalSaraf/Practicals/PSDL/include/proc/pic18lf8680.inc
// Register: CANSTAT_RO8
#define CANSTAT_RO8 CANSTAT_RO8
CANSTAT_RO8                              equ 0E3Eh
// bitfield definitions
CANSTAT_RO8_EICODE0_POSN                 equ 0000h
CANSTAT_RO8_EICODE0_POSITION             equ 0000h
CANSTAT_RO8_EICODE0_SIZE                 equ 0001h
CANSTAT_RO8_EICODE0_LENGTH               equ 0001h
CANSTAT_RO8_EICODE0_MASK                 equ 0001h
CANSTAT_RO8_EICODE1_ICODE0_POSN          equ 0001h
CANSTAT_RO8_EICODE1_ICODE0_POSITION      equ 0001h
CANSTAT_RO8_EICODE1_ICODE0_SIZE          equ 0001h
CANSTAT_RO8_EICODE1_ICODE0_LENGTH        equ 0001h
CANSTAT_RO8_EICODE1_ICODE0_MASK          equ 0002h
CANSTAT_RO8_EICODE2_ICODE1_POSN          equ 0002h
CANSTAT_RO8_EICODE2_ICODE1_POSITION      equ 0002h
CANSTAT_RO8_EICODE2_ICODE1_SIZE          equ 0001h
CANSTAT_RO8_EICODE2_ICODE1_LENGTH        equ 0001h
CANSTAT_RO8_EICODE2_ICODE1_MASK          equ 0004h
CANSTAT_RO8_EICODE3_ICODE2_POSN          equ 0003h
CANSTAT_RO8_EICODE3_ICODE2_POSITION      equ 0003h
CANSTAT_RO8_EICODE3_ICODE2_SIZE          equ 0001h
CANSTAT_RO8_EICODE3_ICODE2_LENGTH        equ 0001h
CANSTAT_RO8_EICODE3_ICODE2_MASK          equ 0008h
CANSTAT_RO8_EICODE4_POSN                 equ 0004h
CANSTAT_RO8_EICODE4_POSITION             equ 0004h
CANSTAT_RO8_EICODE4_SIZE                 equ 0001h
CANSTAT_RO8_EICODE4_LENGTH               equ 0001h
CANSTAT_RO8_EICODE4_MASK                 equ 0010h
CANSTAT_RO8_OPMODE0_POSN                 equ 0005h
CANSTAT_RO8_OPMODE0_POSITION             equ 0005h
CANSTAT_RO8_OPMODE0_SIZE                 equ 0001h
CANSTAT_RO8_OPMODE0_LENGTH               equ 0001h
CANSTAT_RO8_OPMODE0_MASK                 equ 0020h
CANSTAT_RO8_OPMODE1_POSN                 equ 0006h
CANSTAT_RO8_OPMODE1_POSITION             equ 0006h
CANSTAT_RO8_OPMODE1_SIZE                 equ 0001h
CANSTAT_RO8_OPMODE1_LENGTH               equ 0001h
CANSTAT_RO8_OPMODE1_MASK                 equ 0040h
CANSTAT_RO8_OPMODE2_POSN                 equ 0007h
CANSTAT_RO8_OPMODE2_POSITION             equ 0007h
CANSTAT_RO8_OPMODE2_SIZE                 equ 0001h
CANSTAT_RO8_OPMODE2_LENGTH               equ 0001h
CANSTAT_RO8_OPMODE2_MASK                 equ 0080h

// Register: CANCON_RO8
#define CANCON_RO8 CANCON_RO8
CANCON_RO8                               equ 0E3Fh
// bitfield definitions
CANCON_RO8_FP0_POSN                      equ 0000h
CANCON_RO8_FP0_POSITION                  equ 0000h
CANCON_RO8_FP0_SIZE                      equ 0001h
CANCON_RO8_FP0_LENGTH                    equ 0001h
CANCON_RO8_FP0_MASK                      equ 0001h
CANCON_RO8_WIN0_FP1_POSN                 equ 0001h
CANCON_RO8_WIN0_FP1_POSITION             equ 0001h
CANCON_RO8_WIN0_FP1_SIZE                 equ 0001h
CANCON_RO8_WIN0_FP1_LENGTH               equ 0001h
CANCON_RO8_WIN0_FP1_MASK                 equ 0002h
CANCON_RO8_WIN1_FP2_POSN                 equ 0002h
CANCON_RO8_WIN1_FP2_POSITION             equ 0002h
CANCON_RO8_WIN1_FP2_SIZE                 equ 0001h
CANCON_RO8_WIN1_FP2_LENGTH               equ 0001h
CANCON_RO8_WIN1_FP2_MASK                 equ 0004h
CANCON_RO8_WIN2_FP3_POSN                 equ 0003h
CANCON_RO8_WIN2_FP3_POSITION             equ 0003h
CANCON_RO8_WIN2_FP3_SIZE                 equ 0001h
CANCON_RO8_WIN2_FP3_LENGTH               equ 0001h
CANCON_RO8_WIN2_FP3_MASK                 equ 0008h
CANCON_RO8_ABAT_POSN                     equ 0004h
CANCON_RO8_ABAT_POSITION                 equ 0004h
CANCON_RO8_ABAT_SIZE                     equ 0001h
CANCON_RO8_ABAT_LENGTH                   equ 0001h
CANCON_RO8_ABAT_MASK                     equ 0010h
CANCON_RO8_REQOP0_POSN                   equ 0005h
CANCON_RO8_REQOP0_POSITION               equ 0005h
CANCON_RO8_REQOP0_SIZE                   equ 0001h
CANCON_RO8_REQOP0_LENGTH                 equ 0001h
CANCON_RO8_REQOP0_MASK                   equ 0020h
CANCON_RO8_REQOP1_POSN                   equ 0006h
CANCON_RO8_REQOP1_POSITION               equ 0006h
CANCON_RO8_REQOP1_SIZE                   equ 0001h
CANCON_RO8_REQOP1_LENGTH                 equ 0001h
CANCON_RO8_REQOP1_MASK                   equ 0040h
CANCON_RO8_REQOP2_POSN                   equ 0007h
CANCON_RO8_REQOP2_POSITION               equ 0007h
CANCON_RO8_REQOP2_SIZE                   equ 0001h
CANCON_RO8_REQOP2_LENGTH                 equ 0001h
CANCON_RO8_REQOP2_MASK                   equ 0080h

// Register: B2CON
#define B2CON B2CON
B2CON                                    equ 0E40h
// bitfield definitions
B2CON_FILHIT0_TXPRI0_POSN                equ 0000h
B2CON_FILHIT0_TXPRI0_POSITION            equ 0000h
B2CON_FILHIT0_TXPRI0_SIZE                equ 0001h
B2CON_FILHIT0_TXPRI0_LENGTH              equ 0001h
B2CON_FILHIT0_TXPRI0_MASK                equ 0001h
B2CON_FILHIT1_TXPRI1_POSN                equ 0001h
B2CON_FILHIT1_TXPRI1_POSITION            equ 0001h
B2CON_FILHIT1_TXPRI1_SIZE                equ 0001h
B2CON_FILHIT1_TXPRI1_LENGTH              equ 0001h
B2CON_FILHIT1_TXPRI1_MASK                equ 0002h
B2CON_FILHIT2_RTREN_POSN                 equ 0002h
B2CON_FILHIT2_RTREN_POSITION             equ 0002h
B2CON_FILHIT2_RTREN_SIZE                 equ 0001h
B2CON_FILHIT2_RTREN_LENGTH               equ 0001h
B2CON_FILHIT2_RTREN_MASK                 equ 0004h
B2CON_FILHIT3_TXREQ_POSN                 equ 0003h
B2CON_FILHIT3_TXREQ_POSITION             equ 0003h
B2CON_FILHIT3_TXREQ_SIZE                 equ 0001h
B2CON_FILHIT3_TXREQ_LENGTH               equ 0001h
B2CON_FILHIT3_TXREQ_MASK                 equ 0008h
B2CON_FILHIT4_TXERR_POSN                 equ 0004h
B2CON_FILHIT4_TXERR_POSITION             equ 0004h
B2CON_FILHIT4_TXERR_SIZE                 equ 0001h
B2CON_FILHIT4_TXERR_LENGTH               equ 0001h
B2CON_FILHIT4_TXERR_MASK                 equ 0010h
B2CON_RTRRO_TXLARB_POSN                  equ 0005h
B2CON_RTRRO_TXLARB_POSITION              equ 0005h
B2CON_RTRRO_TXLARB_SIZE                  equ 0001h
B2CON_RTRRO_TXLARB_LENGTH                equ 0001h
B2CON_RTRRO_TXLARB_MASK                  equ 0020h
B2CON_RXM1_TXABT_POSN                    equ 0006h
B2CON_RXM1_TXABT_POSITION                equ 0006h
B2CON_RXM1_TXABT_SIZE                    equ 0001h
B2CON_RXM1_TXABT_LENGTH                  equ 0001h
B2CON_RXM1_TXABT_MASK                    equ 0040h
B2CON_RXFUL_TXBIF_POSN                   equ 0007h
B2CON_RXFUL_TXBIF_POSITION               equ 0007h
B2CON_RXFUL_TXBIF_SIZE                   equ 0001h
B2CON_RXFUL_TXBIF_LENGTH                 equ 0001h
B2CON_RXFUL_TXBIF_MASK                   equ 0080h
B2CON_FILHIT0_POSN                       equ 0000h
B2CON_FILHIT0_POSITION                   equ 0000h
B2CON_FILHIT0_SIZE                       equ 0001h
B2CON_FILHIT0_LENGTH                     equ 0001h
B2CON_FILHIT0_MASK                       equ 0001h
B2CON_FILHIT1_POSN                       equ 0001h
B2CON_FILHIT1_POSITION                   equ 0001h
B2CON_FILHIT1_SIZE                       equ 0001h
B2CON_FILHIT1_LENGTH                     equ 0001h
B2CON_FILHIT1_MASK                       equ 0002h
B2CON_FILHIT2_POSN                       equ 0002h
B2CON_FILHIT2_POSITION                   equ 0002h
B2CON_FILHIT2_SIZE                       equ 0001h
B2CON_FILHIT2_LENGTH                     equ 0001h
B2CON_FILHIT2_MASK                       equ 0004h
B2CON_FILHIT3_POSN                       equ 0003h
B2CON_FILHIT3_POSITION                   equ 0003h
B2CON_FILHIT3_SIZE                       equ 0001h
B2CON_FILHIT3_LENGTH                     equ 0001h
B2CON_FILHIT3_MASK                       equ 0008h
B2CON_FILHIT4_POSN                       equ 0004h
B2CON_FILHIT4_POSITION                   equ 0004h
B2CON_FILHIT4_SIZE                       equ 0001h
B2CON_FILHIT4_LENGTH                     equ 0001h
B2CON_FILHIT4_MASK                       equ 0010h
B2CON_RTRRO_POSN                         equ 0005h
B2CON_RTRRO_POSITION                     equ 0005h
B2CON_RTRRO_SIZE                         equ 0001h
B2CON_RTRRO_LENGTH                       equ 0001h
B2CON_RTRRO_MASK                         equ 0020h
B2CON_RXM1_POSN                          equ 0006h
B2CON_RXM1_POSITION                      equ 0006h
B2CON_RXM1_SIZE                          equ 0001h
B2CON_RXM1_LENGTH                        equ 0001h
B2CON_RXM1_MASK                          equ 0040h
B2CON_RXFUL_POSN                         equ 0007h
B2CON_RXFUL_POSITION                     equ 0007h
B2CON_RXFUL_SIZE                         equ 0001h
B2CON_RXFUL_LENGTH                       equ 0001h
B2CON_RXFUL_MASK                         equ 0080h
B2CON_TXPRI0_POSN                        equ 0000h
B2CON_TXPRI0_POSITION                    equ 0000h
B2CON_TXPRI0_SIZE                        equ 0001h
B2CON_TXPRI0_LENGTH                      equ 0001h
B2CON_TXPRI0_MASK                        equ 0001h
B2CON_TXPRI1_POSN                        equ 0001h
B2CON_TXPRI1_POSITION                    equ 0001h
B2CON_TXPRI1_SIZE                        equ 0001h
B2CON_TXPRI1_LENGTH                      equ 0001h
B2CON_TXPRI1_MASK                        equ 0002h
B2CON_RTREN_POSN                         equ 0002h
B2CON_RTREN_POSITION                     equ 0002h
B2CON_RTREN_SIZE                         equ 0001h
B2CON_RTREN_LENGTH                       equ 0001h
B2CON_RTREN_MASK                         equ 0004h
B2CON_TXREQ_POSN                         equ 0003h
B2CON_TXREQ_POSITION                     equ 0003h
B2CON_TXREQ_SIZE                         equ 0001h
B2CON_TXREQ_LENGTH                       equ 0001h
B2CON_TXREQ_MASK                         equ 0008h
B2CON_TXERR_POSN                         equ 0004h
B2CON_TXERR_POSITION                     equ 0004h
B2CON_TXERR_SIZE                         equ 0001h
B2CON_TXERR_LENGTH                       equ 0001h
B2CON_TXERR_MASK                         equ 0010h
B2CON_TXLARB_POSN                        equ 0005h
B2CON_TXLARB_POSITION                    equ 0005h
B2CON_TXLARB_SIZE                        equ 0001h
B2CON_TXLARB_LENGTH                      equ 0001h
B2CON_TXLARB_MASK                        equ 0020h
B2CON_TXABT_POSN                         equ 0006h
B2CON_TXABT_POSITION                     equ 0006h
B2CON_TXABT_SIZE                         equ 0001h
B2CON_TXABT_LENGTH                       equ 0001h
B2CON_TXABT_MASK                         equ 0040h
B2CON_TXBIF_POSN                         equ 0007h
B2CON_TXBIF_POSITION                     equ 0007h
B2CON_TXBIF_SIZE                         equ 0001h
B2CON_TXBIF_LENGTH                       equ 0001h
B2CON_TXBIF_MASK                         equ 0080h
B2CON_B2FILHIT0_POSN                     equ 0000h
B2CON_B2FILHIT0_POSITION                 equ 0000h
B2CON_B2FILHIT0_SIZE                     equ 0001h
B2CON_B2FILHIT0_LENGTH                   equ 0001h
B2CON_B2FILHIT0_MASK                     equ 0001h
B2CON_B2FILHIT1_POSN                     equ 0001h
B2CON_B2FILHIT1_POSITION                 equ 0001h
B2CON_B2FILHIT1_SIZE                     equ 0001h
B2CON_B2FILHIT1_LENGTH                   equ 0001h
B2CON_B2FILHIT1_MASK                     equ 0002h
B2CON_B2FILHIT2_POSN                     equ 0002h
B2CON_B2FILHIT2_POSITION                 equ 0002h
B2CON_B2FILHIT2_SIZE                     equ 0001h
B2CON_B2FILHIT2_LENGTH                   equ 0001h
B2CON_B2FILHIT2_MASK                     equ 0004h
B2CON_B2FILHIT3_POSN                     equ 0003h
B2CON_B2FILHIT3_POSITION                 equ 0003h
B2CON_B2FILHIT3_SIZE                     equ 0001h
B2CON_B2FILHIT3_LENGTH                   equ 0001h
B2CON_B2FILHIT3_MASK                     equ 0008h
B2CON_B2FILHIT4_POSN                     equ 0004h
B2CON_B2FILHIT4_POSITION                 equ 0004h
B2CON_B2FILHIT4_SIZE                     equ 0001h
B2CON_B2FILHIT4_LENGTH                   equ 0001h
B2CON_B2FILHIT4_MASK                     equ 0010h
B2CON_B2RTRRO_POSN                       equ 0005h
B2CON_B2RTRRO_POSITION                   equ 0005h
B2CON_B2RTRRO_SIZE                       equ 0001h
B2CON_B2RTRRO_LENGTH                     equ 0001h
B2CON_B2RTRRO_MASK                       equ 0020h
B2CON_B2RXM1_POSN                        equ 0006h
B2CON_B2RXM1_POSITION                    equ 0006h
B2CON_B2RXM1_SIZE                        equ 0001h
B2CON_B2RXM1_LENGTH                      equ 0001h
B2CON_B2RXM1_MASK                        equ 0040h
B2CON_B2RXFUL_POSN                       equ 0007h
B2CON_B2RXFUL_POSITION                   equ 0007h
B2CON_B2RXFUL_SIZE                       equ 0001h
B2CON_B2RXFUL_LENGTH                     equ 0001h
B2CON_B2RXFUL_MASK                       equ 0080h
B2CON_B2TXPRI0_POSN                      equ 0000h
B2CON_B2TXPRI0_POSITION                  equ 0000h
B2CON_B2TXPRI0_SIZE                      equ 0001h
B2CON_B2TXPRI0_LENGTH                    equ 0001h
B2CON_B2TXPRI0_MASK                      equ 0001h
B2CON_B2TXPRI1_POSN                      equ 0001h
B2CON_B2TXPRI1_POSITION                  equ 0001h
B2CON_B2TXPRI1_SIZE                      equ 0001h
B2CON_B2TXPRI1_LENGTH                    equ 0001h
B2CON_B2TXPRI1_MASK                      equ 0002h
B2CON_B2RTREN_POSN                       equ 0002h
B2CON_B2RTREN_POSITION                   equ 0002h
B2CON_B2RTREN_SIZE                       equ 0001h
B2CON_B2RTREN_LENGTH                     equ 0001h
B2CON_B2RTREN_MASK                       equ 0004h
B2CON_B2TXREQ_POSN                       equ 0003h
B2CON_B2TXREQ_POSITION                   equ 0003h
B2CON_B2TXREQ_SIZE                       equ 0001h
B2CON_B2TXREQ_LENGTH                     equ 0001h
B2CON_B2TXREQ_MASK                       equ 0008h
B2CON_B2TXERR_POSN                       equ 0004h
B2CON_B2TXERR_POSITION                   equ 0004h
B2CON_B2TXERR_SIZE                       equ 0001h
B2CON_B2TXERR_LENGTH                     equ 0001h
B2CON_B2TXERR_MASK                       equ 0010h
B2CON_B2TXLARB_POSN                      equ 0005h
B2CON_B2TXLARB_POSITION                  equ 0005h
B2CON_B2TXLARB_SIZE                      equ 0001h
B2CON_B2TXLARB_LENGTH                    equ 0001h
B2CON_B2TXLARB_MASK                      equ 0020h
B2CON_B2TXABT_POSN                       equ 0006h
B2CON_B2TXABT_POSITION                   equ 0006h
B2CON_B2TXABT_SIZE                       equ 0001h
B2CON_B2TXABT_LENGTH                     equ 0001h
B2CON_B2TXABT_MASK                       equ 0040h
B2CON_B2TXB3IF_POSN                      equ 0007h
B2CON_B2TXB3IF_POSITION                  equ 0007h
B2CON_B2TXB3IF_SIZE                      equ 0001h
B2CON_B2TXB3IF_LENGTH                    equ 0001h
B2CON_B2TXB3IF_MASK                      equ 0080h

// Register: B2SIDH
#define B2SIDH B2SIDH
B2SIDH                                   equ 0E41h
// bitfield definitions
B2SIDH_SID3_POSN                         equ 0000h
B2SIDH_SID3_POSITION                     equ 0000h
B2SIDH_SID3_SIZE                         equ 0001h
B2SIDH_SID3_LENGTH                       equ 0001h
B2SIDH_SID3_MASK                         equ 0001h
B2SIDH_SID4_POSN                         equ 0001h
B2SIDH_SID4_POSITION                     equ 0001h
B2SIDH_SID4_SIZE                         equ 0001h
B2SIDH_SID4_LENGTH                       equ 0001h
B2SIDH_SID4_MASK                         equ 0002h
B2SIDH_SID5_POSN                         equ 0002h
B2SIDH_SID5_POSITION                     equ 0002h
B2SIDH_SID5_SIZE                         equ 0001h
B2SIDH_SID5_LENGTH                       equ 0001h
B2SIDH_SID5_MASK                         equ 0004h
B2SIDH_SID6_POSN                         equ 0003h
B2SIDH_SID6_POSITION                     equ 0003h
B2SIDH_SID6_SIZE                         equ 0001h
B2SIDH_SID6_LENGTH                       equ 0001h
B2SIDH_SID6_MASK                         equ 0008h
B2SIDH_SID7_POSN                         equ 0004h
B2SIDH_SID7_POSITION                     equ 0004h
B2SIDH_SID7_SIZE                         equ 0001h
B2SIDH_SID7_LENGTH                       equ 0001h
B2SIDH_SID7_MASK                         equ 0010h
B2SIDH_SID8_POSN                         equ 0005h
B2SIDH_SID8_POSITION                     equ 0005h
B2SIDH_SID8_SIZE                         equ 0001h
B2SIDH_SID8_LENGTH                       equ 0001h
B2SIDH_SID8_MASK                         equ 0020h
B2SIDH_SID9_POSN                         equ 0006h
B2SIDH_SID9_POSITION                     equ 0006h
B2SIDH_SID9_SIZE                         equ 0001h
B2SIDH_SID9_LENGTH                       equ 0001h
B2SIDH_SID9_MASK                         equ 0040h
B2SIDH_SID10_POSN                        equ 0007h
B2SIDH_SID10_POSITION                    equ 0007h
B2SIDH_SID10_SIZE                        equ 0001h
B2SIDH_SID10_LENGTH                      equ 0001h
B2SIDH_SID10_MASK                        equ 0080h
B2SIDH_B2SID3_POSN                       equ 0000h
B2SIDH_B2SID3_POSITION                   equ 0000h
B2SIDH_B2SID3_SIZE                       equ 0001h
B2SIDH_B2SID3_LENGTH                     equ 0001h
B2SIDH_B2SID3_MASK                       equ 0001h
B2SIDH_B2SID4_POSN                       equ 0001h
B2SIDH_B2SID4_POSITION                   equ 0001h
B2SIDH_B2SID4_SIZE                       equ 0001h
B2SIDH_B2SID4_LENGTH                     equ 0001h
B2SIDH_B2SID4_MASK                       equ 0002h
B2SIDH_B2SID5_POSN                       equ 0002h
B2SIDH_B2SID5_POSITION                   equ 0002h
B2SIDH_B2SID5_SIZE                       equ 0001h
B2SIDH_B2SID5_LENGTH                     equ 0001h
B2SIDH_B2SID5_MASK                       equ 0004h
B2SIDH_B2SID6_POSN                       equ 0003h
B2SIDH_B2SID6_POSITION                   equ 0003h
B2SIDH_B2SID6_SIZE                       equ 0001h
B2SIDH_B2SID6_LENGTH                     equ 0001h
B2SIDH_B2SID6_MASK                       equ 0008h
B2SIDH_B2SID7_POSN                       equ 0004h
B2SIDH_B2SID7_POSITION                   equ 0004h
B2SIDH_B2SID7_SIZE                       equ 0001h
B2SIDH_B2SID7_LENGTH                     equ 0001h
B2SIDH_B2SID7_MASK                       equ 0010h
B2SIDH_B2SID8_POSN                       equ 0005h
B2SIDH_B2SID8_POSITION                   equ 0005h
B2SIDH_B2SID8_SIZE                       equ 0001h
B2SIDH_B2SID8_LENGTH                     equ 0001h
B2SIDH_B2SID8_MASK                       equ 0020h
B2SIDH_B2SID9_POSN                       equ 0006h
B2SIDH_B2SID9_POSITION                   equ 0006h
B2SIDH_B2SID9_SIZE                       equ 0001h
B2SIDH_B2SID9_LENGTH                     equ 0001h
B2SIDH_B2SID9_MASK                       equ 0040h
B2SIDH_B2SID10_POSN                      equ 0007h
B2SIDH_B2SID10_POSITION                  equ 0007h
B2SIDH_B2SID10_SIZE                      equ 0001h
B2SIDH_B2SID10_LENGTH                    equ 0001h
B2SIDH_B2SID10_MASK                      equ 0080h

