GopalSaraf/Practicals/PSDL/include/proc/pic18lf8680.inc
// Register: PCL
#define PCL PCL
PCL                                      equ 0FF9h

// Register: PCLATH
#define PCLATH PCLATH
PCLATH                                   equ 0FFAh

// Register: PCLATU
#define PCLATU PCLATU
PCLATU                                   equ 0FFBh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 0FFCh
// bitfield definitions
STKPTR_STKPTR_POSN                       equ 0000h
STKPTR_STKPTR_POSITION                   equ 0000h
STKPTR_STKPTR_SIZE                       equ 0005h
STKPTR_STKPTR_LENGTH                     equ 0005h
STKPTR_STKPTR_MASK                       equ 001Fh
STKPTR_STKUNF_POSN                       equ 0006h
STKPTR_STKUNF_POSITION                   equ 0006h
STKPTR_STKUNF_SIZE                       equ 0001h
STKPTR_STKUNF_LENGTH                     equ 0001h
STKPTR_STKUNF_MASK                       equ 0040h
STKPTR_STKFUL_POSN                       equ 0007h
STKPTR_STKFUL_POSITION                   equ 0007h
STKPTR_STKFUL_SIZE                       equ 0001h
STKPTR_STKFUL_LENGTH                     equ 0001h
STKPTR_STKFUL_MASK                       equ 0080h
STKPTR_STKPTR0_POSN                      equ 0000h
STKPTR_STKPTR0_POSITION                  equ 0000h
STKPTR_STKPTR0_SIZE                      equ 0001h
STKPTR_STKPTR0_LENGTH                    equ 0001h
STKPTR_STKPTR0_MASK                      equ 0001h
STKPTR_STKPTR1_POSN                      equ 0001h
STKPTR_STKPTR1_POSITION                  equ 0001h
STKPTR_STKPTR1_SIZE                      equ 0001h
STKPTR_STKPTR1_LENGTH                    equ 0001h
STKPTR_STKPTR1_MASK                      equ 0002h
STKPTR_STKPTR2_POSN                      equ 0002h
STKPTR_STKPTR2_POSITION                  equ 0002h
STKPTR_STKPTR2_SIZE                      equ 0001h
STKPTR_STKPTR2_LENGTH                    equ 0001h
STKPTR_STKPTR2_MASK                      equ 0004h
STKPTR_STKPTR3_POSN                      equ 0003h
STKPTR_STKPTR3_POSITION                  equ 0003h
STKPTR_STKPTR3_SIZE                      equ 0001h
STKPTR_STKPTR3_LENGTH                    equ 0001h
STKPTR_STKPTR3_MASK                      equ 0008h
STKPTR_STKPTR4_POSN                      equ 0004h
STKPTR_STKPTR4_POSITION                  equ 0004h
STKPTR_STKPTR4_SIZE                      equ 0001h
STKPTR_STKPTR4_LENGTH                    equ 0001h
STKPTR_STKPTR4_MASK                      equ 0010h
STKPTR_STKOVF_POSN                       equ 0007h
STKPTR_STKOVF_POSITION                   equ 0007h
STKPTR_STKOVF_SIZE                       equ 0001h
STKPTR_STKOVF_LENGTH                     equ 0001h
STKPTR_STKOVF_MASK                       equ 0080h

// Register: TOS
#define TOS TOS
TOS                                      equ 0FFDh

// Register: TOSL
#define TOSL TOSL
TOSL                                     equ 0FFDh

// Register: TOSH
#define TOSH TOSH
TOSH                                     equ 0FFEh

// Register: TOSU
#define TOSU TOSU
TOSU                                     equ 0FFFh

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 0FFFFFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 0FFh)
#endif
#define ABDEN                            BANKMASK(BAUDCON), 0, a
#define ACKDT                            BANKMASK(SSPCON2), 5, a
#define ACKEN                            BANKMASK(SSPCON2), 4, a
#define ACKSTAT                          BANKMASK(SSPCON2), 6, a
#define ACQT0                            BANKMASK(ADCON2), 3, a
#define ACQT1                            BANKMASK(ADCON2), 4, a
#define ACQT2                            BANKMASK(ADCON2), 5, a
#define AD0                              BANKMASK(PORTD), 0, a
#define AD1                              BANKMASK(PORTD), 1, a
#define AD10                             BANKMASK(PORTE), 2, a
#define AD11                             BANKMASK(PORTE), 3, a
#define AD12                             BANKMASK(PORTE), 4, a
#define AD13                             BANKMASK(PORTE), 5, a
#define AD14                             BANKMASK(PORTE), 6, a
#define AD15                             BANKMASK(PORTE), 7, a
#define AD16                             BANKMASK(PORTH), 0, a
#define AD17                             BANKMASK(PORTH), 1, a
#define AD18                             BANKMASK(PORTH), 2, a
#define AD19                             BANKMASK(PORTH), 3, a
#define AD2                              BANKMASK(PORTD), 2, a
#define AD3                              BANKMASK(PORTD), 3, a
#define AD4                              BANKMASK(PORTD), 4, a
#define AD5                              BANKMASK(PORTD), 5, a
#define AD6                              BANKMASK(PORTD), 6, a
#define AD7                              BANKMASK(PORTD), 7, a
#define AD8                              BANKMASK(PORTE), 0, a
#define AD9                              BANKMASK(PORTE), 1, a
#define ADCS0                            BANKMASK(ADCON2), 0, a
#define ADCS1                            BANKMASK(ADCON2), 1, a
#define ADCS2                            BANKMASK(ADCON2), 2, a
#define ADDEN                            BANKMASK(RCSTA), 3, a
#define ADDEN1                           BANKMASK(RCSTA), 3, a
#define ADEN                             BANKMASK(RCSTA), 3, a
#define ADFM                             BANKMASK(ADCON2), 7, a
#define ADIE                             BANKMASK(PIE1), 6, a
#define ADIF                             BANKMASK(PIR1), 6, a
#define ADIP                             BANKMASK(IPR1), 6, a
#define ADON                             BANKMASK(ADCON0), 0, a
#define ALE                              BANKMASK(PORTJ), 0, a
#define AN0                              BANKMASK(PORTA), 0, a
#define AN1                              BANKMASK(PORTA), 1, a
#define AN10                             BANKMASK(PORTF), 5, a
#define AN11                             BANKMASK(PORTF), 6, a
#define AN12                             BANKMASK(PORTH), 4, a
#define AN13                             BANKMASK(PORTH), 5, a
#define AN14                             BANKMASK(PORTH), 6, a
#define AN15                             BANKMASK(PORTH), 7, a
#define AN2                              BANKMASK(PORTA), 2, a
#define AN3                              BANKMASK(PORTA), 3, a
#define AN4                              BANKMASK(PORTA), 5, a
#define AN5                              BANKMASK(PORTF), 0, a
#define AN6                              BANKMASK(PORTF), 1, a
#define AN7                              BANKMASK(PORTF), 2, a
#define AN8                              BANKMASK(PORTF), 3, a
#define AN9                              BANKMASK(PORTF), 4, a
#define B0D00                            BANKMASK(B0D0), 0, b
#define B0D01                            BANKMASK(B0D0), 1, b
#define B0D02                            BANKMASK(B0D0), 2, b
#define B0D03                            BANKMASK(B0D0), 3, b
#define B0D04                            BANKMASK(B0D0), 4, b
#define B0D05                            BANKMASK(B0D0), 5, b
#define B0D06                            BANKMASK(B0D0), 6, b
#define B0D07                            BANKMASK(B0D0), 7, b
#define B0D10                            BANKMASK(B0D1), 0, b
#define B0D11                            BANKMASK(B0D1), 1, b
#define B0D12                            BANKMASK(B0D1), 2, b
#define B0D13                            BANKMASK(B0D1), 3, b
#define B0D14                            BANKMASK(B0D1), 4, b
#define B0D15                            BANKMASK(B0D1), 5, b
#define B0D16                            BANKMASK(B0D1), 6, b
#define B0D17                            BANKMASK(B0D1), 7, b
#define B0D20                            BANKMASK(B0D2), 0, b
#define B0D21                            BANKMASK(B0D2), 1, b
#define B0D22                            BANKMASK(B0D2), 2, b
#define B0D23                            BANKMASK(B0D2), 3, b
#define B0D24                            BANKMASK(B0D2), 4, b
#define B0D25                            BANKMASK(B0D2), 5, b
#define B0D26                            BANKMASK(B0D2), 6, b
#define B0D27                            BANKMASK(B0D2), 7, b
#define B0D30                            BANKMASK(B0D3), 0, b
#define B0D31                            BANKMASK(B0D3), 1, b
#define B0D32                            BANKMASK(B0D3), 2, b
#define B0D33                            BANKMASK(B0D3), 3, b
#define B0D34                            BANKMASK(B0D3), 4, b
#define B0D35                            BANKMASK(B0D3), 5, b
#define B0D36                            BANKMASK(B0D3), 6, b
#define B0D37                            BANKMASK(B0D3), 7, b
#define B0D40                            BANKMASK(B0D4), 0, b
#define B0D41                            BANKMASK(B0D4), 1, b
#define B0D42                            BANKMASK(B0D4), 2, b
#define B0D43                            BANKMASK(B0D4), 3, b
#define B0D44                            BANKMASK(B0D4), 4, b
#define B0D45                            BANKMASK(B0D4), 5, b
#define B0D46                            BANKMASK(B0D4), 6, b
#define B0D47                            BANKMASK(B0D4), 7, b
#define B0D50                            BANKMASK(B0D5), 0, b
#define B0D51                            BANKMASK(B0D5), 1, b
#define B0D52                            BANKMASK(B0D5), 2, b
#define B0D53                            BANKMASK(B0D5), 3, b
#define B0D54                            BANKMASK(B0D5), 4, b
#define B0D55                            BANKMASK(B0D5), 5, b
#define B0D56                            BANKMASK(B0D5), 6, b
#define B0D57                            BANKMASK(B0D5), 7, b
#define B0D60                            BANKMASK(B0D6), 0, b
#define B0D61                            BANKMASK(B0D6), 1, b
#define B0D62                            BANKMASK(B0D6), 2, b
#define B0D63                            BANKMASK(B0D6), 3, b
#define B0D64                            BANKMASK(B0D6), 4, b
#define B0D65                            BANKMASK(B0D6), 5, b
#define B0D66                            BANKMASK(B0D6), 6, b
#define B0D67                            BANKMASK(B0D6), 7, b
#define B0D70                            BANKMASK(B0D7), 0, b
#define B0D71                            BANKMASK(B0D7), 1, b
#define B0D72                            BANKMASK(B0D7), 2, b
#define B0D73                            BANKMASK(B0D7), 3, b
#define B0D74                            BANKMASK(B0D7), 4, b
#define B0D75                            BANKMASK(B0D7), 5, b
#define B0D76                            BANKMASK(B0D7), 6, b
#define B0D77                            BANKMASK(B0D7), 7, b
#define B0DLC0                           BANKMASK(B0DLC), 0, b
#define B0DLC1                           BANKMASK(B0DLC), 1, b
#define B0DLC2                           BANKMASK(B0DLC), 2, b
#define B0DLC3                           BANKMASK(B0DLC), 3, b
#define B0EID0                           BANKMASK(B0EIDL), 0, b
#define B0EID1                           BANKMASK(B0EIDL), 1, b
#define B0EID10                          BANKMASK(B0EIDH), 2, b
#define B0EID11                          BANKMASK(B0EIDH), 3, b
#define B0EID12                          BANKMASK(B0EIDH), 4, b
#define B0EID13                          BANKMASK(B0EIDH), 5, b
#define B0EID14                          BANKMASK(B0EIDH), 6, b
#define B0EID15                          BANKMASK(B0EIDH), 7, b
#define B0EID16                          BANKMASK(B0SIDL), 0, b
#define B0EID17                          BANKMASK(B0SIDL), 1, b
#define B0EID2                           BANKMASK(B0EIDL), 2, b
#define B0EID3                           BANKMASK(B0EIDL), 3, b
#define B0EID4                           BANKMASK(B0EIDL), 4, b
#define B0EID5                           BANKMASK(B0EIDL), 5, b
#define B0EID6                           BANKMASK(B0EIDL), 6, b
#define B0EID7                           BANKMASK(B0EIDL), 7, b
#define B0EID8                           BANKMASK(B0EIDH), 0, b
#define B0EID9                           BANKMASK(B0EIDH), 1, b
#define B0EXID                           BANKMASK(B0SIDL), 3, b
#define B0FILHIT0                        BANKMASK(B0CON), 0, b
#define B0FILHIT1                        BANKMASK(B0CON), 1, b
#define B0FILHIT2                        BANKMASK(B0CON), 2, b
#define B0FILHIT3                        BANKMASK(B0CON), 3, b
#define B0FILHIT4                        BANKMASK(B0CON), 4, b
#define B0IE                             BANKMASK(BIE0), 2, b
#define B0RB0                            BANKMASK(B0DLC), 4, b
#define B0RB1                            BANKMASK(B0DLC), 5, b
#define B0RTREN                          BANKMASK(B0CON), 2, b
#define B0RTRRO                          BANKMASK(B0CON), 5, b
#define B0RXFUL                          BANKMASK(B0CON), 7, b
#define B0RXM1                           BANKMASK(B0CON), 6, b
#define B0RXRTR                          BANKMASK(B0DLC), 6, b
#define B0SID0                           BANKMASK(B0SIDL), 5, b
#define B0SID1                           BANKMASK(B0SIDL), 6, b
#define B0SID10                          BANKMASK(B0SIDH), 7, b
#define B0SID2                           BANKMASK(B0SIDL), 7, b
#define B0SID3                           BANKMASK(B0SIDH), 0, b
#define B0SID4                           BANKMASK(B0SIDH), 1, b
#define B0SID5                           BANKMASK(B0SIDH), 2, b
#define B0SID6                           BANKMASK(B0SIDH), 3, b
#define B0SID7                           BANKMASK(B0SIDH), 4, b
#define B0SID8                           BANKMASK(B0SIDH), 5, b
#define B0SID9                           BANKMASK(B0SIDH), 6, b
#define B0SRR                            BANKMASK(B0SIDL), 4, b
#define B0TXABT                          BANKMASK(B0CON), 6, b
#define B0TXB3IF                         BANKMASK(B0CON), 7, b
#define B0TXEN                           BANKMASK(BSEL0), 2, b
#define B0TXERR                          BANKMASK(B0CON), 4, b
#define B0TXLARB                         BANKMASK(B0CON), 5, b
#define B0TXPRI0                         BANKMASK(B0CON), 0, b
#define B0TXPRI1                         BANKMASK(B0CON), 1, b
#define B0TXREQ                          BANKMASK(B0CON), 3, b
#define B1D00                            BANKMASK(B1D0), 0, b
#define B1D01                            BANKMASK(B1D0), 1, b
#define B1D02                            BANKMASK(B1D0), 2, b
#define B1D03                            BANKMASK(B1D0), 3, b
#define B1D04                            BANKMASK(B1D0), 4, b
#define B1D05                            BANKMASK(B1D0), 5, b
#define B1D06                            BANKMASK(B1D0), 6, b
#define B1D07                            BANKMASK(B1D0), 7, b
#define B1D10                            BANKMASK(B1D1), 0, b
#define B1D11                            BANKMASK(B1D1), 1, b
#define B1D12                            BANKMASK(B1D1), 2, b
#define B1D13                            BANKMASK(B1D1), 3, b
#define B1D14                            BANKMASK(B1D1), 4, b
#define B1D15                            BANKMASK(B1D1), 5, b
#define B1D16                            BANKMASK(B1D1), 6, b
#define B1D17                            BANKMASK(B1D1), 7, b
#define B1D20                            BANKMASK(B1D2), 0, b
#define B1D21                            BANKMASK(B1D2), 1, b
#define B1D22                            BANKMASK(B1D2), 2, b
#define B1D23                            BANKMASK(B1D2), 3, b
#define B1D24                            BANKMASK(B1D2), 4, b
#define B1D25                            BANKMASK(B1D2), 5, b
#define B1D26                            BANKMASK(B1D2), 6, b
#define B1D27                            BANKMASK(B1D2), 7, b
#define B1D30                            BANKMASK(B1D3), 0, b
#define B1D31                            BANKMASK(B1D3), 1, b
#define B1D32                            BANKMASK(B1D3), 2, b
#define B1D33                            BANKMASK(B1D3), 3, b
#define B1D34                            BANKMASK(B1D3), 4, b
#define B1D35                            BANKMASK(B1D3), 5, b
#define B1D36                            BANKMASK(B1D3), 6, b
#define B1D37                            BANKMASK(B1D3), 7, b
#define B1D40                            BANKMASK(B1D4), 0, b
#define B1D41                            BANKMASK(B1D4), 1, b
#define B1D42                            BANKMASK(B1D4), 2, b
#define B1D43                            BANKMASK(B1D4), 3, b
#define B1D44                            BANKMASK(B1D4), 4, b
#define B1D45                            BANKMASK(B1D4), 5, b
#define B1D46                            BANKMASK(B1D4), 6, b
#define B1D47                            BANKMASK(B1D4), 7, b
#define B1D50                            BANKMASK(B1D5), 0, b
#define B1D51                            BANKMASK(B1D5), 1, b
#define B1D52                            BANKMASK(B1D5), 2, b
#define B1D53                            BANKMASK(B1D5), 3, b
#define B1D54                            BANKMASK(B1D5), 4, b
#define B1D55                            BANKMASK(B1D5), 5, b
#define B1D56                            BANKMASK(B1D5), 6, b
#define B1D57                            BANKMASK(B1D5), 7, b
#define B1D60                            BANKMASK(B1D6), 0, b
#define B1D61                            BANKMASK(B1D6), 1, b
#define B1D62                            BANKMASK(B1D6), 2, b
#define B1D63                            BANKMASK(B1D6), 3, b
#define B1D64                            BANKMASK(B1D6), 4, b
#define B1D65                            BANKMASK(B1D6), 5, b
#define B1D66                            BANKMASK(B1D6), 6, b
#define B1D67                            BANKMASK(B1D6), 7, b
#define B1D70                            BANKMASK(B1D7), 0, b
#define B1D71                            BANKMASK(B1D7), 1, b
#define B1D72                            BANKMASK(B1D7), 2, b
#define B1D73                            BANKMASK(B1D7), 3, b
#define B1D74                            BANKMASK(B1D7), 4, b
#define B1D75                            BANKMASK(B1D7), 5, b
#define B1D76                            BANKMASK(B1D7), 6, b
#define B1D77                            BANKMASK(B1D7), 7, b
#define B1DLC0                           BANKMASK(B1DLC), 0, b
#define B1DLC1                           BANKMASK(B1DLC), 1, b
#define B1DLC2                           BANKMASK(B1DLC), 2, b
#define B1DLC3                           BANKMASK(B1DLC), 3, b
#define B1EID0                           BANKMASK(B1EIDL), 0, b
#define B1EID1                           BANKMASK(B1EIDL), 1, b
#define B1EID10                          BANKMASK(B1EIDH), 2, b
#define B1EID11                          BANKMASK(B1EIDH), 3, b
#define B1EID12                          BANKMASK(B1EIDH), 4, b
#define B1EID13                          BANKMASK(B1EIDH), 5, b
#define B1EID14                          BANKMASK(B1EIDH), 6, b
#define B1EID15                          BANKMASK(B1EIDH), 7, b
#define B1EID16                          BANKMASK(B1SIDL), 0, b
#define B1EID17                          BANKMASK(B1SIDL), 1, b
#define B1EID2                           BANKMASK(B1EIDL), 2, b
#define B1EID3                           BANKMASK(B1EIDL), 3, b
#define B1EID4                           BANKMASK(B1EIDL), 4, b
#define B1EID5                           BANKMASK(B1EIDL), 5, b
#define B1EID6                           BANKMASK(B1EIDL), 6, b
#define B1EID7                           BANKMASK(B1EIDL), 7, b
#define B1EID8                           BANKMASK(B1EIDH), 0, b
#define B1EID9                           BANKMASK(B1EIDH), 1, b
#define B1EXID                           BANKMASK(B1SIDL), 3, b
#define B1FILHIT0                        BANKMASK(B1CON), 0, b
#define B1FILHIT1                        BANKMASK(B1CON), 1, b
#define B1FILHIT2                        BANKMASK(B1CON), 2, b
#define B1FILHIT3                        BANKMASK(B1CON), 3, b
#define B1FILHIT4                        BANKMASK(B1CON), 4, b
#define B1IE                             BANKMASK(BIE0), 3, b
#define B1RB0                            BANKMASK(B1DLC), 4, b
#define B1RB1                            BANKMASK(B1DLC), 5, b
#define B1RTREN                          BANKMASK(B1CON), 2, b
#define B1RTRRO                          BANKMASK(B1CON), 5, b
#define B1RXFUL                          BANKMASK(B1CON), 7, b
#define B1RXM1                           BANKMASK(B1CON), 6, b
#define B1RXRTR                          BANKMASK(B1DLC), 6, b
#define B1SID0                           BANKMASK(B1SIDL), 5, b
#define B1SID1                           BANKMASK(B1SIDL), 6, b
#define B1SID10                          BANKMASK(B1SIDH), 7, b
#define B1SID2                           BANKMASK(B1SIDL), 7, b
#define B1SID3                           BANKMASK(B1SIDH), 0, b
#define B1SID4                           BANKMASK(B1SIDH), 1, b
#define B1SID5                           BANKMASK(B1SIDH), 2, b
#define B1SID6                           BANKMASK(B1SIDH), 3, b
#define B1SID7                           BANKMASK(B1SIDH), 4, b
#define B1SID8                           BANKMASK(B1SIDH), 5, b
#define B1SID9                           BANKMASK(B1SIDH), 6, b
#define B1SRR                            BANKMASK(B1SIDL), 4, b
#define B1TXABT                          BANKMASK(B1CON), 6, b
#define B1TXB3IF                         BANKMASK(B1CON), 7, b
#define B1TXEN                           BANKMASK(BSEL0), 3, b
#define B1TXERR                          BANKMASK(B1CON), 4, b
#define B1TXLARB                         BANKMASK(B1CON), 5, b
#define B1TXPRI0                         BANKMASK(B1CON), 0, b
#define B1TXPRI1                         BANKMASK(B1CON), 1, b
#define B1TXREQ                          BANKMASK(B1CON), 3, b
#define B2D00                            BANKMASK(B2D0), 0, b
#define B2D01                            BANKMASK(B2D0), 1, b
#define B2D02                            BANKMASK(B2D0), 2, b
#define B2D03                            BANKMASK(B2D0), 3, b
#define B2D04                            BANKMASK(B2D0), 4, b
#define B2D05                            BANKMASK(B2D0), 5, b
#define B2D06                            BANKMASK(B2D0), 6, b
#define B2D07                            BANKMASK(B2D0), 7, b
#define B2D10                            BANKMASK(B2D1), 0, b
#define B2D11                            BANKMASK(B2D1), 1, b
#define B2D12                            BANKMASK(B2D1), 2, b
#define B2D13                            BANKMASK(B2D1), 3, b
#define B2D14                            BANKMASK(B2D1), 4, b
#define B2D15                            BANKMASK(B2D1), 5, b
#define B2D16                            BANKMASK(B2D1), 6, b
#define B2D17                            BANKMASK(B2D1), 7, b
#define B2D20                            BANKMASK(B2D2), 0, b
#define B2D21                            BANKMASK(B2D2), 1, b
#define B2D22                            BANKMASK(B2D2), 2, b
#define B2D23                            BANKMASK(B2D2), 3, b
#define B2D24                            BANKMASK(B2D2), 4, b
#define B2D25                            BANKMASK(B2D2), 5, b
#define B2D26                            BANKMASK(B2D2), 6, b
#define B2D27                            BANKMASK(B2D2), 7, b
#define B2D30                            BANKMASK(B2D3), 0, b
#define B2D31                            BANKMASK(B2D3), 1, b
#define B2D32                            BANKMASK(B2D3), 2, b
#define B2D33                            BANKMASK(B2D3), 3, b
#define B2D34                            BANKMASK(B2D3), 4, b
#define B2D35                            BANKMASK(B2D3), 5, b
#define B2D36                            BANKMASK(B2D3), 6, b
#define B2D37                            BANKMASK(B2D3), 7, b
#define B2D40                            BANKMASK(B2D4), 0, b
#define B2D41                            BANKMASK(B2D4), 1, b
#define B2D42                            BANKMASK(B2D4), 2, b
#define B2D43                            BANKMASK(B2D4), 3, b
